#!/usr/bin/python 
# -*- coding: utf-8 -*- 

class RussiaRules:
    StrPatrinomics = """
    @patrinomic-male
        =>~["-a", "-ья"]
            << ["-a"] > "ич"
        # Слово-исключение. Обнаружил самостоятельно.
        << ["ираклий"] > "ираклиевич"

        << ["", "-я"] > "ович"
        << ["-ай", "-а"] > "аевич"

        # Напр., "Жюльевич"
        << ["-ий", "-ь"] > "ьевич"

    @patrinomic-female
        =>~["-а", "-ья"]
            #имена с ударением на последний слог
            =>~["илья", "фома", "к(у|о)зьма", "лука"]
                << ["-а", "-ья"] > "инична"
            =>
                << ["-а"] > "ична"

        << ["-ий"] > "ьевна"
        << ["-ай"] > "аевна"
        << ["овна"]
    """